Project/Toir.Adaptation/src/Documents/гкс_УстановкаСоответствийДолжностейИКвалификаций/гкс_УстановкаСоответствийДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6c97e420-95e4-408e-a566-e7ccc68f480e">
  <name>гкс_УстановкаСоответствийДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="557516a2-3182-4127-a360-581e4fcfad13">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="334a845e-a148-4216-be8a-910b135a351b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20cfd757-f794-4769-8d79-afff4753efa8">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9244cedb-ef22-4f63-bea6-114804f94c1d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="84c97917-5fa8-470c-ba02-17fcb0a7bcdf">
    <name>Квалификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c6da1565-eba1-4d40-8e31-0912abafb6c8">
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c22d0388-a499-4050-ad2c-3097e6db0b81">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="72c7b58c-2134-4ea4-a093-6a7b6bde4dde">
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6245ad7c-d63f-4ba1-b08b-cfea682f5233">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="05b9fd1c-2f5a-4c5b-aacc-99a73f0ea883">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcbb889-225d-4201-a516-de6ba512a5f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61c5c699-fd38-4321-ab3d-405fc46cd6b9">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/гкс_УстановкаСоответствийДолжностейИКвалификаций/ObjectModule.bsl
#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Подразделение КАК Подразделение,
		|	Соответствия.Должность КАК Должность,
		|	Соответствия.Квалификация КАК Квалификация
		|ИЗ
		|	Документ.гкс_УстановкаСоответствийДолжностейИКвалификаций.Квалификации КАК Соответствия
		|ГДЕ
		|	Соответствия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// РС гкс_СоответствияДолжностейИКвалификаций
	Движения.гкс_СоответствияДолжностейИКвалификаций.Записывать = Истина;
	Движения.гкс_СоответствияДолжностейИКвалификаций.Очистить();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.гкс_СоответствияДолжностейИКвалификаций.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка); 				
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
		
КонецПроцедуры

&Вместо("ПриКопировании")
Процедура гкс_ПриКопировании(ОбъектКопирования)
	Квалификации.Очистить();	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры

#КонецОбласти
